Revit 2024 API
BuiltInFailures.ConnectorFailures.NotAllowedToModifyGroupElementsError Property
 Connection to a group failed. Modification of elements within a group is not allowed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NotAllowedToModifyGroupElementsError { get; }
Visual Basic
Public Shared ReadOnly Property NotAllowedToModifyGroupElementsError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NotAllowedToModifyGroupElementsError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ConnectorFailures Class
Autodesk.Revit.DB Namespace